In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from env import host, user, password

import seaborn as sns
from pydataset import data

<center><h1>Table of Contents</h1></center>

- <a href='#PS'>Pandas Series</a>
    - <a href='#howto'>How to Declare a Pandas Series</a>
    - <a href='#VO'>Vectorized Operations</a>
    - <a href='#series attributes'>Series Attributes</a>
        - <a href='#sindex'>.index</a>
        - <a href='#svalues'>.values</a>
        - <a href='#sdtype'>.dtype</a>
        - <a href='#sname'>.name</a>
        - <a href='#sshape'>.shape</a>
    - <a href='#seriesmethods'>Series Methods</a>
        - <a href='#headtailsample'>.head() .tail() .sample() </a>
        - <a href='#astype'>.astype()</a>
        - <a href='#valuecounts'>.value_counts()</a>
        - <a href='#describe'>.describe()</a>
        - <a href='#nlargest'>.nlargest() .nsmallest()</a>
        - <a href='#sortvaluesindex'>.sort_values() .sort_index()</a>
        - <a href='#isin'>.isin()</a>
        - <a href='#apply'>.apply()</a>
        - <a href='#pdcut'>pd.cut()</a>
    - <a href='#andor'>and/or statements</a>
    - <a href='#str'>.str</a>
        - <a href='#lower'>str.lower()</a>
        - <a href='#replace'>str.replace()</a>
        - <a href='#startswith'>str.startswith()</a>
        - <a href='#contains'>.str.contains()</a>
- <a href='#df'>Pandas Dataframes</a>
    - <a href='#dfatrributes'>Dataframe Attributes</a>
        - <a href='#dtypes'>dtypes</a>
        - <a href='#shape'>shape</a>
        - <a href='#columns'>columns</a>
        - <a href='#dfindex'>index</a>
    - <a href='#dfmethods'>Dataframe Methods</a>
        - <a href='#dfdescribe'>.describe()</a>
        - <a href='#dfinfo'>.info()</a>
        - <a href='#dfhead'>.head()</a>
        - <a href='#dfdrop'>.drop()</a>
        - <a href='#dfsort'>.sort_values()</a>
    - <a href='#newcol'>Create New Columns</a>
        - <a href='#assign'>.assign()</a>
    - <a href='#amc'>Accessing Multiple Columns</a>
    - <a href='#agg'>Aggregating</a>
    - <a href='#where'>np.where</a>
    - <a href='#sql'>SQL</a>

<a id='PS'><center><h1>Pandas Series</h1></center></a>

In [3]:
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan', 'Josh', 'Josh','Josh']

In [4]:
simple_ints = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [5]:
simple_floats = [1.1, 2.2, 3.3, 4.4]

In [6]:
numbers =  ['$796,459.41', '$278.60', '$482,571.67',\
                     '$4,503,915.98', '$2,121,418.3', '$1,260,813.3',\
                     '$87,231.01', '$1,509,175.45', '$4,138,548.00', '$2,848,913.80',\
                     '$594,715.39', '$4,789,988.17', '$4,513,644.5', '$3,191,059.97',\
                     '$1,758,712.24', '$4,338,283.54', '$4,738,303.38', '$2,791,759.67',\
                     '$769,681.94', '$452,650.23']

<a id='howto'><center><h1>How to Declare a Pandas Series</h1></center></a>

In [7]:
students = pd.Series(students)

In [8]:
simple_ints = pd.Series(simple_ints)

In [9]:
numbers = pd.Series(numbers)

In [10]:
simple_floats = pd.Series(simple_floats)

<div class="alert alert-block alert-warning">
<b><h1>Type?</h1> You can use type() to let you know the type of any variable</b>

In [11]:
type(numbers)

pandas.core.series.Series

<a id='VO'><center><h1>Vectorized Operations</h1></center></a>

In [12]:
students + " Chavez"

0       Sally Chavez
1        Jane Chavez
2       Suzie Chavez
3       Billy Chavez
4         Ada Chavez
5        John Chavez
6      Thomas Chavez
7       Marie Chavez
8      Albert Chavez
9     Richard Chavez
10      Isaac Chavez
11       Alan Chavez
12       Josh Chavez
13       Josh Chavez
14       Josh Chavez
dtype: object

In [13]:
simple_ints + 3

0     4
1     5
2     6
3     7
4     8
5     9
6    10
7    11
8    12
9    13
dtype: int64

In [14]:
simple_ints > 3

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

<a id='series attributes'><center><h1>Series Attributes</h1></center></a>

<a id='sindex'><h3>.index</h3></a>

In [15]:
numbers.index

RangeIndex(start=0, stop=20, step=1)

In [16]:
numbers.index[3] #returns the value of the "index".  Not corresponding column value

3

In [17]:
numbers.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

<a id='svalues'><h3>.values</h3></a>

In [18]:
numbers.values

array(['$796,459.41', '$278.60', '$482,571.67', '$4,503,915.98',
       '$2,121,418.3', '$1,260,813.3', '$87,231.01', '$1,509,175.45',
       '$4,138,548.00', '$2,848,913.80', '$594,715.39', '$4,789,988.17',
       '$4,513,644.5', '$3,191,059.97', '$1,758,712.24', '$4,338,283.54',
       '$4,738,303.38', '$2,791,759.67', '$769,681.94', '$452,650.23'],
      dtype=object)

In [19]:
numbers.values[0]

'$796,459.41'

In [20]:
type(numbers.values) #returns a numpy array

numpy.ndarray

<a id='sdtype'><h3>.dtype</h3></a>

In [21]:
simple_floats.dtype

dtype('float64')

In [22]:
students.dtype #type O for objects strings are considered Objects

dtype('O')

In [23]:
simple_ints.dtype

dtype('int64')

<a id='sname'><h3>.name</h3></a>

In [24]:
simple_floats.name = "simple floats"

In [25]:
simple_floats.name

'simple floats'

<a id='sshape'><h3>.shape</h3></a>

In [26]:
simple_floats.shape

(4,)

In [27]:
students.shape

(15,)

In [28]:
simple_ints.shape

(10,)

In [29]:
numbers.shape

(20,)

<a id='seriesmethods'><center><h1>Series Methods</h1></center></a>

<a id='headtailsample'><h3>.head() .tail() .sample()</h3></a>

In [30]:
numbers.head() # First 5 Values

0      $796,459.41
1          $278.60
2      $482,571.67
3    $4,503,915.98
4     $2,121,418.3
dtype: object

In [31]:
numbers.tail() # Last 5 Values

15    $4,338,283.54
16    $4,738,303.38
17    $2,791,759.67
18      $769,681.94
19      $452,650.23
dtype: object

In [32]:
numbers.sample(5) #Random Values, notice I had to tell it I wanted 5 Values, default is one random number

0       $796,459.41
8     $4,138,548.00
15    $4,338,283.54
6        $87,231.01
18      $769,681.94
dtype: object

<a id='astype'><h3>.astype()</h3></a>

In [33]:
simple_ints.astype("float")

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [34]:
simple_floats.astype("int")

0    1
1    2
2    3
3    4
Name: simple floats, dtype: int64

<a id='valuecounts'><h3>.value_counts()</h3></a>

In [35]:
students.value_counts()

Josh       3
Thomas     1
Sally      1
Albert     1
Ada        1
Jane       1
Suzie      1
Billy      1
Richard    1
Marie      1
Isaac      1
Alan       1
John       1
dtype: int64

<a id='describe'><h3>.describe()</h3></a>

In [36]:
students.describe()

count       15
unique      13
top       Josh
freq         3
dtype: object

In [37]:
numbers.describe()

count               20
unique              20
top       $1,260,813.3
freq                 1
dtype: object

In [38]:
simple_ints.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

<a id='nlargest'><h3>.nlargest() .nsmallest()</h3></a>

In [39]:
simple_floats.nlargest()

3    4.4
2    3.3
1    2.2
0    1.1
Name: simple floats, dtype: float64

In [40]:
simple_floats.nlargest().head(1)

3    4.4
Name: simple floats, dtype: float64

In [41]:
simple_ints.nsmallest()

0    1
1    2
2    3
3    4
4    5
dtype: int64

<a id='sortvaluesindex'><h3>.sort_values() .sort_index()</h3></a>

In [42]:
simple_ints.sort_values(ascending=False)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

In [43]:
simple_ints.sort_values(ascending=False)

9    10
8     9
7     8
6     7
5     6
4     5
3     4
2     3
1     2
0     1
dtype: int64

<div class="alert alert-block alert-warning">
<b><h1>sort_values(By="?")</h1> Series does not have by='example', that is a DataFrame</b>

<a id='isin'><h3>.isin()</h3></a>

In [44]:
vowels = list('aeiou')
vowels

['a', 'e', 'i', 'o', 'u']

In [45]:
letters = list('abcdefghijk')
letters

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']

<a id='.apply'><h3>.apply()</h3></a>

<a id='andor'><center><h1>And/Or Statements</h1></center></a>

In [46]:
(simple_ints % 2 == 0) & (simple_ints> 7) #And statement Even and greater than 7 returns boolean mask

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [47]:
simple_ints[(simple_ints % 2 == 0) & (simple_ints> 7)] #And statement Even and greater than 7

7     8
9    10
dtype: int64

In [48]:
(simple_ints % 2 != 0) | (simple_ints > 5) #Odd or great than 5 Boolean mask

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [49]:
simple_ints[(simple_ints % 2 != 0) | (simple_ints > 5)]# returned Values

0     1
2     3
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

<a id='str'><center><h1>.str</h1></center></a>

<a id='lower'><h3>str.lower()</h3></a>

In [50]:
students.tail(5)

10    Isaac
11     Alan
12     Josh
13     Josh
14     Josh
dtype: object

In [51]:
students.str.lower().tail(5)

10    isaac
11     alan
12     josh
13     josh
14     josh
dtype: object

<a id='replace'><h3>str.replace()</h3></a>

In [52]:
numbers.str.replace("$", "").head(5)

<ipython-input-52-bf63bb9351cd>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  numbers.str.replace("$", "").head(5)

0      796,459.41
1          278.60
2      482,571.67
3    4,503,915.98
4     2,121,418.3
dtype: object

In [53]:
numbers.head(5) #notice the orginal numbers is not mutated

0      $796,459.41
1          $278.60
2      $482,571.67
3    $4,503,915.98
4     $2,121,418.3
dtype: object

<a id='startswith'><h3>str.startswith()</h3></a>

In [54]:
students.str.startswith("J") #returns Boolean Mask

0     False
1      True
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13     True
14     True
dtype: bool

In [55]:
students[students.str.startswith("J")]

1     Jane
5     John
12    Josh
13    Josh
14    Josh
dtype: object

In [56]:
numbers.str.startswith("$").head(5) # remember numbers is a string

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [57]:
numbers[numbers.str.startswith("$")].head(5)

0      $796,459.41
1          $278.60
2      $482,571.67
3    $4,503,915.98
4     $2,121,418.3
dtype: object

<a id='contains'><h3>str.contains()</h3></a>

In [58]:
students.str.contains("Jo").tail(5) # Returns Boolean Mask

10    False
11    False
12     True
13     True
14     True
dtype: bool

In [59]:
students[students.str.contains("Jo")].tail(5)

5     John
12    Josh
13    Josh
14    Josh
dtype: object

<a id='isin'><h3>.isin()</h3></a>

In [60]:
vowels = list('aeiou')
vowels

['a', 'e', 'i', 'o', 'u']

In [61]:
letters = list('abcdefghijk')
letters

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']

In [62]:
letters_series = pd.Series(letters)
letters_series

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
dtype: object

In [63]:
Boolean_mask = letters_series.isin(vowels)

In [64]:
Boolean_mask

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8      True
9     False
10    False
dtype: bool

In [65]:
letters_series[Boolean_mask]

0    a
4    e
8    i
dtype: object

<a id='apply'><h3>.apply()</h3></a>

In [66]:
def times5(input_value):
        return input_value *5

In [67]:
new_series = simple_ints.apply(times5)  #Same a the example below using lambda

In [68]:
new_series

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int64

In [69]:
new_series = simple_ints.apply(lambda x : x *5) #Same as creating a function as above

In [70]:
new_series

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
9    50
dtype: int64

In [71]:
# if and else statement inside lambda example below

In [72]:
new_series = simple_ints.apply(lambda simple_ints : True if simple_ints > 5 else False)

In [73]:
new_series

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
dtype: bool

<a id='pdcut'><h3>pd.cut()</h3></a>

In [74]:
s = pd.Series(list(range(16)))
s

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
dtype: int64

In [75]:
pd.cut(s, bins=4)

0     (-0.015, 3.75]
1     (-0.015, 3.75]
2     (-0.015, 3.75]
3     (-0.015, 3.75]
4        (3.75, 7.5]
5        (3.75, 7.5]
6        (3.75, 7.5]
7        (3.75, 7.5]
8       (7.5, 11.25]
9       (7.5, 11.25]
10      (7.5, 11.25]
11      (7.5, 11.25]
12     (11.25, 15.0]
13     (11.25, 15.0]
14     (11.25, 15.0]
15     (11.25, 15.0]
dtype: category
Categories (4, interval[float64]): [(-0.015, 3.75] < (3.75, 7.5] < (7.5, 11.25] < (11.25, 15.0]]

In [76]:
pd.cut(s, 3).value_counts() # you can use value counts on your bins

(-0.015, 5.0]    6
(5.0, 10.0]      5
(10.0, 15.0]     5
dtype: int64

In [77]:
pd.cut(s, bins=4, labels=["0-3", "4-7", "8-11", "12-15"]) #using labels

0       0-3
1       0-3
2       0-3
3       0-3
4       4-7
5       4-7
6       4-7
7       4-7
8      8-11
9      8-11
10     8-11
11     8-11
12    12-15
13    12-15
14    12-15
15    12-15
dtype: category
Categories (4, object): ['0-3' < '4-7' < '8-11' < '12-15']

<a id='df'><center><h1>Pandas Dataframes</h1></center></a>

In [78]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

<a id='dfatrributes'><center><h1>Dataframes Attributes</h1></center></a>

<a id='dtypes'><h3>.dtypes</h3></a>

In [79]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

<a id='shape'><h3>.shape</h3></a>

In [80]:
df.shape

(12, 4)

<a id='columns'><h3>.columns</h3></a>

In [81]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

<a id='dfindex'><h3>.index</h3></a>

In [82]:
df.index

RangeIndex(start=0, stop=12, step=1)

<a id='dfmethods'><center><h1>Dataframes Methods</h1></center></a>

<a id='dfdescribe'><h3>.describe()</h3></a>

In [83]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

<a id='dfinfo'><h3>.info()</h3></a>

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

<a id='dfhead'><h3>.head()</h3></a>

In [85]:
df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

<a id='dfrename'><h3>.rename()</h3></a>

In [86]:
df.rename(columns={'name': 'student'})

    student  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

<a id='dfdrop'><h3>.drop()</h3></a>

In [87]:
df.drop(columns=['english', 'reading'])

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

In [88]:
df.drop(columns=['english', 'reading']).rename(columns={'name': 'student'})

    student  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

<a id='dfsort'><h3>.sort_values()</h3></a>

In [89]:
df.sort_values(by='english').head() #notice the by= you can sort by two values

      name  math  english  reading
8   Albert    92       62       87
11    Alan    92       62       72
7    Marie    93       63       90
6   Thomas    82       64       81
2    Suzie    94       74       95

In [90]:
df.sort_values(by=['english', 'reading']).head() #sort by two vaules

      name  math  english  reading
11    Alan    92       62       72
8   Albert    92       62       87
7    Marie    93       63       90
6   Thomas    82       64       81
2    Suzie    94       74       95

<a id='newcol'><center><h1>Create New Columns</h1></center></a>

In [91]:
df['passing_math'] = df.math > 70

In [92]:
df.head()

    name  math  english  reading  passing_math
0  Sally    62       85       80         False
1   Jane    88       79       67          True
2  Suzie    94       74       95          True
3  Billy    98       96       88          True
4    Ada    77       92       98          True

<a id='assign'><h3>.assign()</h3></a>

In [93]:
df.assign(passing_english=df.english >= 70).head()

    name  math  english  reading  passing_math  passing_english
0  Sally    62       85       80         False             True
1   Jane    88       79       67          True             True
2  Suzie    94       74       95          True             True
3  Billy    98       96       88          True             True
4    Ada    77       92       98          True             True

<a id='amc'><center><h1>Accessing Multiple Columns</h1></center></a>

In [94]:
df[['name', 'math']].head()#can call the columns this way

    name  math
0  Sally    62
1   Jane    88
2  Suzie    94
3  Billy    98
4    Ada    77

In [95]:
columns = ['name', 'math'] # or can call them this way
df[columns].head()

    name  math
0  Sally    62
1   Jane    88
2  Suzie    94
3  Billy    98
4    Ada    77

In [96]:
df[['name', 'math']].sort_values(by='math', ascending=False).head()

      name  math
3    Billy    98
2    Suzie    94
7    Marie    93
8   Albert    92
10   Isaac    92

<a id='agg'><center><h1>Aggregating</h1></center></a>

In [97]:
df.reading.agg('min')

67

In [98]:
df[['english', 'reading', 'math']].agg(['mean', 'min', 'max'])

        english  reading       math
mean  77.666667     86.5  84.833333
min   62.000000     67.0  62.000000
max   99.000000     98.0  98.000000

<a id='groupby'><center><h1>Group By</h1></center></a>

In [99]:
df.groupby("passing_math").math.agg(['min', 'mean', 'max']) #group by must have .agg function

              min  mean  max
passing_math
False          62  65.5   69
True           77  88.7   98

In [100]:
df.groupby("passing_math").english.agg(['min', 'mean', 'max']) #group by must have .agg function

              min  mean  max
passing_math
False          80  82.5   85
True           62  76.7   99

In [109]:
#of those passing and failing math, here are the max english scores
df.groupby('passing_math').english.max().sort_values(ascending=False)

passing_math
passing    99
failing    85
Name: english, dtype: int64

In [101]:
#Groupby & Where example problem from Exercise
#mam[['hoppers', 'speed']].where((mam['speed']>(mam['speed']).median()) & (mam['hoppers']==True)).sort_values(by=['speed'], ascending=False).dropna().count())

<a id='where'><center><h1>np.where</h1></center></a>

In [110]:
# Create the new column based on an existing column
df['passing_math'] = np.where(df.math < 70, 'failing', 'passing')

In [111]:
df.head()

    name  math  english  reading passing_math
0  Sally    62       85       80      failing
1   Jane    88       79       67      passing
2  Suzie    94       74       95      passing
3  Billy    98       96       88      passing
4    Ada    77       92       98      passing

In [104]:
#Groupby & Where example problem from Exercise
#mam[['hoppers', 'speed']].where((mam['speed']>(mam['speed']).median()) & (mam['hoppers']==True)).sort_values(by=['speed'], ascending=False).dropna().count())

In [114]:
df[['math', 'reading', 'english', 'passing_math']].where((df["math"]>70) & (df["reading"]>70) & (df["english"]>70)).dropna()

    math  reading  english passing_math
2   94.0     95.0     74.0      passing
3   98.0     88.0     96.0      passing
4   77.0     98.0     92.0      passing
5   79.0     93.0     76.0      passing
10  92.0     93.0     99.0      passing

<a id='sql'><center><h1>SQL</h1></center></a>

In [120]:
#remember to run this code in the same directory as your env file because you will be importing it in so that 
#these run okay

In [121]:
def get_db_url(url='employees'):
    url = f'mysql+pymysql://{user}:{password}@{host}/{url}'
    return url


employees = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

In [122]:
employees

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [117]:
#Grab all information from all the tables im going to need using SQL
employee = pd.read_sql("Select * From employees", get_db_url())
titles = pd.read_sql("SELECT * FROM titles", get_db_url())
departments = pd.read_sql("SELECT * FROM departments", get_db_url())
dept_emp = pd.read_sql("SELECT * FROM dept_emp", get_db_url())

#Rename the titles and dept_emp to_date/from_date since they have the name column name in their Tables
titles = titles.rename(columns={
    "to_date": "titles_to_date",
    "from_date": "titles_from_date"
})

dept_emp = dept_emp.rename(columns={
    "to_date": "dept_emp_to_date",
    "from_date": "dept_emp_from_date"
})

#Merge all the tables together using inner joins
merged_table = employee.merge(titles, left_on='emp_no', right_on='emp_no', how='inner')
merged_table = merged_table.merge(dept_emp, left_on='emp_no', right_on='emp_no', how='inner')
merged_table = merged_table.merge(departments, left_on='dept_no', right_on='dept_no', how='inner')

In [119]:
merged_table

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,titles_from_date,titles_to_date,dept_no,dept_emp_from_date,dept_emp_to_date,dept_name
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,d005,1986-06-26,9999-01-01,Development
1,10006,1953-04-20,Anneke,Preusig,F,1989-06-02,Senior Engineer,1990-08-05,9999-01-01,d005,1990-08-05,9999-01-01,Development
2,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,Assistant Engineer,1998-03-11,2000-07-31,d005,1998-03-11,2000-07-31,Development
3,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Engineer,1992-12-18,2000-12-18,d005,1992-12-18,9999-01-01,Development
4,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,Senior Engineer,2000-12-18,9999-01-01,d005,1992-12-18,9999-01-01,Development
...,...,...,...,...,...,...,...,...,...,...,...,...,...
489898,499975,1952-11-09,Masali,Chorvat,M,1992-01-23,Staff,1995-11-21,1997-07-23,d002,1996-10-19,1997-07-23,Finance
489899,499977,1956-06-05,Martial,Weisert,F,1996-09-17,Staff,1999-12-28,9999-01-01,d002,1999-12-28,9999-01-01,Finance
489900,499989,1954-05-26,Keiichiro,Lindqvist,M,1993-10-28,Senior Staff,1996-10-29,2001-03-07,d002,1996-10-29,2001-03-07,Finance
489901,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01,d002,1993-12-27,9999-01-01,Finance
489902,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27,d002,1993-12-27,9999-01-01,Finance